app/Http/Controllers/UserController.php

    public function handleProviderCallback()
    {

        $callback = Socialite::driver('google')->stateless()->user();
        $data = [
            'name' => $callback->getName(),
            'email' => $callback->getEmail(),
            'avatar' => $callback->getAvatar(),
            'email_verified_at' => date('Y:m:d H:i:s', time()),
        ];

        $user = User::firstOrCreate(['email' => $data['email']], $data);
---
insert into `users` (`email`, `name`, `avatar`, `updated_at`, `created_at`) values ('muhammadrofiadhim@gmail.com', 'Muh. Rofiadhim Rajab', 'https://lh3.googleusercontent.com/a/AGNmyxY3r0XqI9yboXsKQZcORtsLqm0AmS1UnPnorCBXAA=s96-c', '2023-05-15 03:37:54', '2023-05-15 03:37:54')
select * from `users` where (`email` = 'muhammadrofiadhim@gmail.com') and `users`.`deleted_at` is null limit 1